[
  {
    "title": "प्रेम शुक्ला",
    "initial_info_desc": "Daily Twitter trend in india: प्रेम शुक्ला. Listed on 01/06/2025.",
    "source_name": "Twitter (via www.twitter-trending.com)",
    "content_type": "Social Trend",
    "geo_region": "in",
    "meta_data": {
      "rank": 1,
      "tweet_volume_display": "N/A",
      "collected_at": "2025-06-01 11:14:27 UTC",
      "scraper_list_date": "01/06/2025",
      "period": "Daily",
      "url": "https://www.twitter-trending.com/redirect?s=%25E0%25A4%25AA%25E0%25A5%258D%25E0%25A4%25B0%25E0%25A5%2587%25E0%25A4%25AE%2B%25E0%25A4%25B6%25E0%25A5%2581%25E0%25A4%2595%25E0%25A5%258D%25E0%25A4%25B2%25E0%25A4%25BE",
      "platform": "Twitter",
      "link_to_trend_list": "https://www.twitter-trending.com/india/en",
      "hashtags": []
    },
    "full_text_content_for_llm": "Trending topic on Twitter in in: 'प्रेम शुक्ला'. Listed on 01/06/2025 for the Daily period. Tweet volume: N/A."
  },
  {
    "title": "वेस्ट इंडीज वि इंग्लंड",
    "initial_info_desc": "Google Trend: 'वेस्ट इंडीज वि इंग्लंड'. Related: ENG vs WI ODI: ICC ने दिया वेस्टइंडीज क्रिकेट को झटका, इंग्लैंड के खिलाफ इस गलती के लिए मिली पूरी टीम को सजा",
    "source_name": "Google Trends (trendspy)",
    "content_type": "Search Trend",
    "geo_region": "IN",
    "meta_data": {
      "rank": 4,
      "query": "वेस्ट इंडीज वि इंग्लंड",
      "collected_at": "2025-06-01 11:14:20 UTC",
      "related_news": [
        {
          "title": "ENG vs WI ODI: ICC ने दिया वेस्टइंडीज क्रिकेट को झटका, इंग्लैंड के खिलाफ इस गलती के लिए मिली पूरी टीम को सजा",
          "source": "Patrika News",
          "url": "https://www.patrika.com/cricket-news/west-indies-cricket-punished-by-icc-for-slov-over-rate-against-england-in-first-odi-at-birmingham-19638857"
        },
        {
          "title": "ICC fines West Indies: आईसीसी ने वेस्टइंडीज क्रिकेट टीम को दी सजा, किया था ये अपराध!",
          "source": "सच कहूँ",
          "url": "https://www.sachkahoon.com/icc-fines-west-indies-for-slow-over-rate/"
        },
        {
          "title": "इंग्लैंड में खेल रही इस टीम पर पड़ गई दोहरी मार, अब ICC ने भी ले लिया एक्शन",
          "source": "India TV Hindi",
          "url": "https://www.indiatv.in/sports/cricket/west-indies-cricket-team-fined-slow-over-rate-in-1st-odi-against-england-icc-action-2025-06-01-1139554"
        }
      ],
      "url": "https://www.patrika.com/cricket-news/west-indies-cricket-punished-by-icc-for-slov-over-rate-against-england-in-first-odi-at-birmingham-19638857"
    },
    "full_text_content_for_llm": "पूरी टीम पर लगा जुर्माना आईसीसी ने एक बयान में कहा, “आईसीसी एलीट पैनल के मैच रेफरी जेफ क्रो ने प्रत्येक खिलाड़ी पर मैच फीस का पांच प्रतिशत जुर्माना लगाया है। शाई होप की टीम पारी के अंत में जरूरी टारगेट से एक ओवर पीछे रह गई थी, जिसमें समय की छूट को ध्यान में रखा गया था। यह जुर्माना आईसीसी खिलाड़ी और खिलाड़ी सहायक कर्मचारी आचार संहिता के आर्टिकल 2.22 के अनुरूप है, जो न्यूनतम ओवर-रेट अपराधों से जुड़ा है। आईसीसी नियमों के अनुसार, खिलाड़ियों पर उनकी टीम द्वारा तय समय के अंदर गेंदबाजी न कर पाने वाले प्रत्येक ओवर के लिए उनकी मैच फीस का पांच प्रतिशत जुर्माना लगाया जाता है।” इंग्लैंड ने तीन मुकाबलों की वनडे सीरीज के शुरुआती मैच में बेन डकेट, जो रूट, हैरी ब्रुक और जैकब बेथेल के शानदार अर्धशतकों की बदौलत 400/8 रन बनाए। वेस्टइंडीज की टीम 162 रन ही बना सकी। साकिब महमूद और जेमी ओवरटन ने तीन-तीन विकेट लिए। इंग्लैंड ने 238 रनों से बड़ी जीत दर्ज की। दोनों टीमों के बीच दूसरा वनडे रविवार को कार्डिफ में खेला जाएगा। कार्डिफ में जीत से इंग्लैंड को वेस्टइंडीज के खिलाफ सीरीज जीतने का मौका मिल जाएगा, जबकि एक मैच और खेलना बाकी है। इंग्लैंड की टीम ऑलराउंडर जेमी ओवरटन के बिना उतरेगी, जो दाएं हाथ की छोटी उंगली में फ्रैक्चर के कारण व्हाइट-बॉल सीरीज से बाहर हो गए हैं। मैथ्यू पॉट्स को उनकी जगह चुना गया है और वह इंग्लैंड के लिए अपना 10वां वनडे मैच खेलने के लिए तैयार हैं। ये भी पढ़ें: PKL 12 से पहले बदली पवन सहरावत, अर्जुन देशवाल समेत इन दिग्गजों की टीम, जानें अब तक कौन रहा सबसे मंहगा पूरी टीम पर लगा जुर्माना आईसीसी ने एक बयान में कहा, “आईसीसी एलीट पैनल के मैच रेफरी जेफ क्रो ने प्रत्येक खिलाड़ी पर मैच फीस का पांच प्रतिशत जुर्माना लगाया है। शाई होप की टीम पारी के अंत में जरूरी टारगेट से एक ओवर पीछे रह गई थी, जिसमें समय की छूट को ध्यान में रखा गया था। यह जुर्माना आईसीसी खिलाड़ी और खिलाड़ी सहायक कर्मचारी आचार संहिता के आर्टिकल 2.22 के अनुरूप है, जो न्यूनतम ओवर-रेट अपराधों से जुड़ा है। आईसीसी नियमों के अनुसार, खिलाड़ियों पर उनकी टीम द्वारा तय समय के अंदर गेंदबाजी न कर पाने वाले प्रत्येक ओवर के लिए उनकी मैच फीस का पांच प्रतिशत जुर्माना लगाया जाता है।” इंग्लैंड ने तीन मुकाबलों की वनडे सीरीज के शुरुआती मैच में बेन डकेट, जो रूट, हैरी ब्रुक और जैकब बेथेल के शानदार अर्धशतकों की बदौलत 400/8 रन बनाए। वेस्टइंडीज की टीम 162 रन ही बना सकी। साकिब महमूद और जेमी ओवरटन ने तीन-तीन विकेट लिए। इंग्लैंड ने 238 रनों से बड़ी जीत दर्ज की। दोनों टीमों के बीच दूसरा वनडे रविवार को कार्डिफ में खेला जाएगा। कार्डिफ में जीत से इंग्लैंड को वेस्टइंडीज के खिलाफ सीरीज जीतने का मौका मिल जाएगा, जबकि एक मैच और खेलना बाकी है। इंग्लैंड की टीम ऑलराउंडर जेमी ओवरटन के बिना उतरेगी, जो दाएं हाथ की छोटी उंगली में फ्रैक्चर के कारण व्हाइट-बॉल सीरीज से बाहर हो गए हैं। मैथ्यू पॉट्स को उनकी जगह चुना गया है और वह इंग्लैंड के लिए अपना 10वां वनडे मैच खेलने के लिए तैयार हैं। ये भी पढ़ें: PKL 12 से पहले बदली पवन सहरावत, अर्जुन देशवाल समेत इन दिग्गजों की टीम, जानें अब तक कौन रहा सबसे मंहगा"
  },
  {
    "title": "#ReleaseSharmistha",
    "initial_info_desc": "Daily Twitter trend in india: #ReleaseSharmistha. Listed on 01/06/2025.",
    "source_name": "Twitter (via www.twitter-trending.com)",
    "content_type": "Social Trend",
    "geo_region": "in",
    "meta_data": {
      "rank": 2,
      "tweet_volume_display": "N/A",
      "collected_at": "2025-06-01 11:14:27 UTC",
      "scraper_list_date": "01/06/2025",
      "period": "Daily",
      "url": "https://www.twitter-trending.com/redirect?s=%2523ReleaseSharmistha",
      "platform": "Twitter",
      "link_to_trend_list": "https://www.twitter-trending.com/india/en",
      "hashtags": [
        "#ReleaseSharmistha"
      ]
    },
    "full_text_content_for_llm": "Trending topic on Twitter in in: '#ReleaseSharmistha'. Listed on 01/06/2025 for the Daily period. Tweet volume: N/A."
  },
  {
    "title": "bodoland lottery result",
    "initial_info_desc": "Google Trend: 'bodoland lottery result'. Related: Bodoland Lottery Sambad Result Today 01-06-2025 (OUT): Assam State Sunday Lucky Draw DECLARED At 3 PM - Check Full Winners List",
    "source_name": "Google Trends (trendspy)",
    "content_type": "Search Trend",
    "geo_region": "IN",
    "meta_data": {
      "rank": 1,
      "query": "bodoland lottery result",
      "collected_at": "2025-06-01 11:14:20 UTC",
      "related_news": [
        {
          "title": "Bodoland Lottery Sambad Result Today 01-06-2025 (OUT): Assam State Sunday Lucky Draw DECLARED At 3 PM - Check Full Winners List",
          "source": "Zee News",
          "url": "https://zeenews.india.com/india/live-updates/bodoland-lottery-sambad-result-today-01-06-2025-out-assam-state-sunday-lucky-draw-declared-at-3-pm-check-full-winners-list-2909477.html"
        },
        {
          "title": "Bodoland Lottery Sambad Result Declared On 30.05.2025: Full Winners List For Assam State Friday Lucky Draw",
          "source": "Goodreturns",
          "url": "https://www.goodreturns.in/news/bodoland-lottery-sambad-result-declared-30-05-2025-full-winners-list-assam-state-friday-luck-draw-1432821.html"
        },
        {
          "title": "LIVE | Bodoland Lottery Result Today (22-05-2025): Assam State Lottery Sambad THURSDAY Full Winners List OUT",
          "source": "Republic World",
          "url": "https://www.republicworld.com/info/live-bodoland-lottery-result-today-22-05-2025-assam-state-lottery-sambad-thursday-full-winners-list-out-live-news"
        }
      ],
      "url": "https://zeenews.india.com/india/live-updates/bodoland-lottery-sambad-result-today-01-06-2025-out-assam-state-sunday-lucky-draw-declared-at-3-pm-check-full-winners-list-2909477.html"
    },
    "full_text_content_for_llm": "Advertisement X trendingNow english 2909477 https://zeenews.india.com/india/live-updates/bodoland-lottery-sambad-result-today-01-06-2025-out-assam-state-sunday-lucky-draw-declared-at-3-pm-check-full-winners-list-2909477.html News India BODOLAND LOTTERY RESULT TODAY Bodoland Lottery Sambad Result Today 01-06-2025 (OUT): Assam State Sunday Lucky Draw DECLARED At 3 PM - Check Full Winners List Bodoland Lottery Results Today 01 June 2025 Live: The Assam Bodoland Lottery Department will declare its results today at 3 PM. Participants can view their results at bodollotteries.com, the official website, scroll down for complete winners list. Written By Zee Media Bureau | Last Updated: Jun 01, 2025, 04:11 PM IST | Source: Follow Us Trending Photos 7 Miss World winner From Surviving Breast Surgery At 16 To Making History: Meet Opal Suchata Chuangsri, Miss World 2025 12 IPL 2025 IPL 2025 Qualifier 2: Mumbai Indians' Predicted Playing XI Against Punjab Kings; Richard Gleeson OUT, Deepak Chahar IN; This Bowler To Come As Impact Player 7 Rohit Sharma Most Sixes In IPL History: Rohit Sharma Emulates Chris Gayle; Check List Featuring Top 7 Batters 13 WEEKLY HEALTH HOROSCOPE Weekly Health Horoscope For June 1-8: You’re Feeling Strong But May Neglect Sleep, Check Your Health TIP For The Week Bodoland Lottery Result Today Live LIVE Blog Bodoland Lottery Results Today 01, June 2025: The Bodoland State Lottery Result was accurately published by the Bodoland Lottery Department. This item may be used to get the Bodoland State Lottery Result 2025 by candidates who bought the 2025 Bodoland Lottery tickets. The government of Assam maintains control over the Bodoland lottery, which is part of the Assam Lottery. Every day at 3 PM, the Bodoland lottery is played three times. Each day, a large number of people enter this lottery. This item is critical for those who will participate in the Bodoland Lottery or have signed up for it, as well as for those who wish to understand the results. Assam and Bodoland have their lottery. In Bodoland Lotteries, individual Assam winning sums are divided. The Bodoland Lottery is a well-known lottery that draws a large crowd. The Bodoland Territorial Council, situated in Kokrajhar, can use the Bodoland lottery winners' prize money to laud them. They must submit their authentic ticket within 30 days after the announcement of the results. (NOTE: Lottery can be addictive and should be played responsibly. The information provided on this page is for informational purposes only and should not be construed as advice or encouragement. Zee News does not promote lottery in any way.) Stay Tuned To Zee News For All The Latest And Live Updates On Bodoland Lottery Lucky Draw 01.06.2025 01 June 2025 16:09 IST Bodoland Lottery Result Today 01.06.2025 Live: Assam Sunday Lucky Draw Complete Winners List 15:08 IST Bodoland Lottery Sambad Result Today 01.06.2025 Live: Assam State Sunday Lucky Draw Result DECLARED Stay informed on all the latest news , real-time breaking news updates, and follow all the important headlines in india news and world News on Zee News. TAGS Bodoland Lottery Result Today Bodoland Lottery Results 2025 Bodoland Lottery Result Bodoland lottery Bodoland Result Bodoland Lottery 01-06-2025 Bodoland Lottery 01-06-2025 Result Bodoland Lottery today result Assam State Lottery Result Live Bodoland lottery Result Live Advertisement Advertisement Trending news Murshidabad Will Hindus get justice in Bengal's Murshidabad? DNA Video DNA: Uproar over freebies in Delhi! Shahrukh Pathan DNA: AIMIM plans to field 2020 Delhi riots accused Shahrukh Pathan DNA Video DNA: A report showing the reality of Bangladesh DNA Video DNA: Power Theft Allegations Against SP MP Ziaur Rahman Barq DNA Video DNA: Hot Tea Linked to Cancer Risk! DNA Video DNA: Why Jordan Fears After Syria’s Coup? DNA Video DNA: NSA Ajit Doval’s China Visit - Inside Story DNA Video DNA: Gandhi Family Ruined My Career, says Mani Shankar Aiyar DNA Video DNA: Ground Report- Tight Security Arrangements for Mahakumbh NEWS ON ONE CLICK"
  },
  {
    "title": "10Days Left Kabir Prakat Diwas",
    "initial_info_desc": "Daily Twitter trend in india: 10Days Left Kabir Prakat Diwas. Listed on 01/06/2025.",
    "source_name": "Twitter (via www.twitter-trending.com)",
    "content_type": "Social Trend",
    "geo_region": "in",
    "meta_data": {
      "rank": 3,
      "tweet_volume_display": "N/A",
      "collected_at": "2025-06-01 11:14:27 UTC",
      "scraper_list_date": "01/06/2025",
      "period": "Daily",
      "url": "https://www.twitter-trending.com/redirect?s=10Days%2BLeft%2BKabir%2BPrakat%2BDiwas",
      "platform": "Twitter",
      "link_to_trend_list": "https://www.twitter-trending.com/india/en",
      "hashtags": []
    },
    "full_text_content_for_llm": "Trending topic on Twitter in in: '10Days Left Kabir Prakat Diwas'. Listed on 01/06/2025 for the Daily period. Tweet volume: N/A."
  },
  {
    "title": "keacy carty",
    "initial_info_desc": "Google Trend: 'keacy carty'. Related: KEACY CARTY: FOLLOWING HIS FATHER’S VISION; FULFILLING THEIR DREAM",
    "source_name": "Google Trends (trendspy)",
    "content_type": "Search Trend",
    "geo_region": "IN",
    "meta_data": {
      "rank": 2,
      "query": "keacy carty",
      "collected_at": "2025-06-01 11:14:20 UTC",
      "related_news": [
        {
          "title": "KEACY CARTY: FOLLOWING HIS FATHER’S VISION; FULFILLING THEIR DREAM",
          "source": "Windies",
          "url": "https://www.windiescricket.com/news/keacy-carty-following-his-fathers-vision-fulfilling-their-dream/"
        },
        {
          "title": "Ireland v West Indies: Matthew Forde ties one-day record before washout in Dublin",
          "source": "BBC",
          "url": "https://www.bbc.com/sport/cricket/articles/clyr327gvpro"
        },
        {
          "title": "West Indies captain Shai Hope lauds comeback win and eyes England showdown",
          "source": "Caribbean National Weekly",
          "url": "https://www.caribbeannationalweekly.com/sports/west-indies-captain-shai-hope-lauds-comeback-win-and-eyes-england-showdown/"
        }
      ],
      "url": "https://www.windiescricket.com/news/keacy-carty-following-his-fathers-vision-fulfilling-their-dream/"
    },
    "full_text_content_for_llm": "KEACY CARTY: FOLLOWING HIS FATHER’S VISION; FULFILLING THEIR DREAM May 28, 2025, 4:41 p.m. Keacy Carty raises his bat after scoring 100 in 2nd ODI v Ireland BIRMINGHAM, England- Keacy Carty stormed into the history books of West Indies Cricket by becoming the joint, sixth highest scorer in history, with a breathtaking 170 against Ireland in the third and final one day international at Clontarf in Dublin. Carty marvelled the crowd with his sparkling stroke play consisting of 15 sumptuous fours and 8 crisp sixes which reassured his admirers of his emerging power, to go along with his classy touch and finesse at the crease. This innings ensured the West Indies carved out a 197-run win via the Duckworth Lewis Method. This knock followed a defiant and reassuring 102 in the previous contest, after the West Indies found themselves wobbling on 46 for 2, before posting an imposing 352 for 8 in the second game of the series, which was unfortunately abandoned to due to rain. Prior to these recent outstanding performances, Carty showed his prowess in 2024 by leading the West Indies in scoring with 560 runs at a staggering average of 62.22 in 11 innings, only bettered by Sri Lankans: Kusal Mendis, Pathum Nissanka and Charith Asalanka. Keacy playing a cover drive vs Ireland in the 3rd ODI Carty insists that his transformation in form stems from his attention to detail and his diligence. “After experiencing some success in Australia, I knew that I just needed to focus on improving my weaker areas, so I ensured that I put in the hours and time ahead of every series with strategic intent if I was to improve and evolve as a player, not only for myself but also the team in the wider scheme of things.” Head Coach Daren Sammy spoke glowingly about the batter’s emergence especially with his current role in the team. “When you think about the phrase ‘hard work brings rewards’, Keacy is definitely a reflection of that because the role that management has now given him, the way he has grabbed that opportunity and made the best out of it, it makes you happy.” As a fringe player in 2023, Carty watched from the sidelines as the West Indies missed out on qualification for the 50 over World Cup that year in India, and that it was that agonizing feeling which fuelled his commitment and temperament over the last 17 months. Keacy Carty celebrates his 2nd 100 v Ireland in the 3rd ODI “In that moment I knew, that if I ever had the opportunity, that I would never allow us to be in this position going forward ever again.” He shared. “It wasn’t good for the team, or the region, given that it’s the first that has ever happened and even though I was not a regular at the time, seeing the disappointment and sadness of the players made it painful and we are now on a path with a collective mindset to ensure it never happens again.” At age 25, Carty created history when he was selected to tour the Netherlands, becoming the first cricketer born in the island of St Maarten to make a West Indies squad. He went on to make his debut days later, but his journey started at a tender age through the visionary eyes of his father. “It started with my father, he was a cricketer, he still plays but not as much. He always told me that he would teach me all that he could to ensure that I would become more than just the ordinary player.” The elegant right hander admitted that he was forced into the game but realized he could maximize his potential given that he could make a living from the game and recalls some of the sacrifices his father made. “He took me out of junior cricket in St Maarten at an early age, deciding that it was more beneficial for me to train and play with grown men, rather than my Under-15 counterparts. This ensured that I was exposed to more advanced training, which quickly proved to be the right decision.” Carty’s name was on the top of everyone’s lips in 2016 when he hit a patient and match defining half century to guide the West Indies to their first ever Under-19 title in Bangladesh. He then matriculated into the Leeward Islands team the same year, however, he took him another six years to be called up to the West Indies squad. This called for patience and belief but there was never self doubt from the right-handed batter. “I was never worried about getting to the senior level, but I questioned myself a little wondering if I was good enough, but after you gradually start to reap some of the rewards of your hard work you start to tell yourself you can do it.” Keacy Carty has been fearless throughout his emerging journey, and now during his senior stint, continues to show the value of having a strong drive and desire to succeed. This article was written by Jerome Foster, Content and Media Officer assigned to the West Indies Men’s Senior Team KEACY CARTY: FOLLOWING HIS FATHER’S VISION; FULFILLING THEIR DREAM May 28, 2025, 4:41 p.m. Keacy Carty raises his bat after scoring 100 in 2nd ODI v Ireland BIRMINGHAM, England- Keacy Carty stormed into the history books of West Indies Cricket by becoming the joint, sixth highest scorer in history, with a breathtaking 170 against Ireland in the third and final one day international at Clontarf in Dublin. Carty marvelled the crowd with his sparkling stroke play consisting of 15 sumptuous fours and 8 crisp sixes which reassured his admirers of his emerging power, to go along with his classy touch and finesse at the crease. This innings ensured the West Indies carved out a 197-run win via the Duckworth Lewis Method. This knock followed a defiant and reassuring 102 in the previous contest, after the West Indies found themselves wobbling on 46 for 2, before posting an imposing 352 for 8 in the second game of the series, which was unfortunately abandoned to due to rain. Prior to these recent outstanding performances, Carty showed his prowess in 2024 by leading the West Indies in scoring with 560 runs at a staggering average of 62.22 in 11 innings, only bettered by Sri Lankans: Kusal Mendis, Pathum Nissanka and Charith Asalanka. Keacy playing a cover drive vs Ireland in the 3rd ODI Carty insists that his transformation in form stems from his attention to detail and his diligence. “After experiencing some success in Australia, I knew that I just needed to focus on improving my weaker areas, so I ensured that I put in the hours and time ahead of every series with strategic intent if I was to improve and evolve as a player, not only for myself but also the team in the wider scheme of things.” Head Coach Daren Sammy spoke glowingly about the batter’s emergence especially with his current role in the team. “When you think about the phrase ‘hard work brings rewards’, Keacy is definitely a reflection of that because the role that management has now given him, the way he has grabbed that opportunity and made the best out of it, it makes you happy.” As a fringe player in 2023, Carty watched from the sidelines as the West Indies missed out on qualification for the 50 over World Cup that year in India, and that it was that agonizing feeling which fuelled his commitment and temperament over the last 17 months. Keacy Carty celebrates his 2nd 100 v Ireland in the 3rd ODI “In that moment I knew, that if I ever had the opportunity, that I would never allow us to be in this position going forward ever again.” He shared. “It wasn’t good for the team, or the region, given that it’s the first that has ever happened and even though I was not a regular at the time, seeing the disappointment and sadness of the players made it painful and we are now on a path with a collective mindset to ensure it never happens again.” At age 25, Carty created history when he was selected to tour the Netherlands, becoming the first cricketer born in the island of St Maarten to make a West Indies squad. He went on to make his debut days later, but his journey started at a tender age through the visionary eyes of his father. “It started with my father, he was a cricketer, he still plays but not as much. He always told me that he would teach me all that he could to ensure that I would become more than just the ordinary player.” The elegant right hander admitted that he was forced into the game but realized he could maximize his potential given that he could make a living from the game and recalls some of the sacrifices his father made. “He took me out of junior cricket in St Maarten at an early age, deciding that it was more beneficial for me to train and play with grown men, rather than my Under-15 counterparts. This ensured that I was exposed to more advanced training, which quickly proved to be the right decision.” Carty’s name was on the top of everyone’s lips in 2016 when he hit a patient and match defining half century to guide the West Indies to their first ever Under-19 title in Bangladesh. He then matriculated into the Leeward Islands team the same year, however, he took him another six years to be called up to the West Indies squad. This called for patience and belief but there was never self doubt from the right-handed batter. “I was never worried about getting to the senior level, but I questioned myself a little wondering if I was good enough, but after you gradually start to reap some of the rewards of your hard work you start to tell yourself you can do it.” Keacy Carty has been fearless throughout his emerging journey, and now during his senior stint, continues to show the value of having a strong drive and desire to succeed. This article was written by Jerome Foster, Content and Media Officer assigned to the West Indies Men’s Senior Team News / Special Feature / KEACY CARTY: FOLLOWING HIS FATHER’S VISION; FULFILLING THEIR DREAM KEACY CARTY: FOLLOWING HIS FATHER’S VISION; FULFILLING THEIR DREAM May 28, 2025, 4:41 p.m. Keacy Carty raises his bat after scoring 100 in 2nd ODI v Ireland BIRMINGHAM, England- Keacy Carty stormed into the history books of West Indies Cricket by becoming the joint, sixth highest scorer in history, with a breathtaking 170 against Ireland in the third and final one day international at Clontarf in Dublin. Carty marvelled the crowd with his sparkling stroke play consisting of 15 sumptuous fours and 8 crisp sixes which reassured his admirers of his emerging power, to go along with his classy touch and finesse at the crease. This innings ensured the West Indies carved out a 197-run win via the Duckworth Lewis Method. This knock followed a defiant and reassuring 102 in the previous contest, after the West Indies found themselves wobbling on 46 for 2, before posting an imposing 352 for 8 in the second game of the series, which was unfortunately abandoned to due to rain. Prior to these recent outstanding performances, Carty showed his prowess in 2024 by leading the West Indies in scoring with 560 runs at a staggering average of 62.22 in 11 innings, only bettered by Sri Lankans: Kusal Mendis, Pathum Nissanka and Charith Asalanka. Keacy playing a cover drive vs Ireland in the 3rd ODI Carty insists that his transformation in form stems from his attention to detail and his diligence. “After experiencing some success in Australia, I knew that I just needed to focus on improving my weaker areas, so I ensured that I put in the hours and time ahead of every series with strategic intent if I was to improve and evolve as a player, not only for myself but also the team in the wider scheme of things.” Head Coach Daren Sammy spoke glowingly about the batter’s emergence especially with his current role in the team. “When you think about the phrase ‘hard work brings rewards’, Keacy is definitely a reflection of that because the role that management has now given him, the way he has grabbed that opportunity and made the best out of it, it makes you happy.” As a fringe player in 2023, Carty watched from the sidelines as the West Indies missed out on qualification for the 50 over World Cup that year in India, and that it was that agonizing feeling which fuelled his commitment and temperament over the last 17 months. Keacy Carty celebrates his 2nd 100 v Ireland in the 3rd ODI “In that moment I knew, that if I ever had the opportunity, that I would never allow us to be in this position going forward ever again.” He shared. “It wasn’t good for the team, or the region, given that it’s the first that has ever happened and even though I was not a regular at the time, seeing the disappointment and sadness of the players made it painful and we are now on a path with a collective mindset to ensure it never happens again.” At age 25, Carty created history when he was selected to tour the Netherlands, becoming the first cricketer born in the island of St Maarten to make a West Indies squad. He went on to make his debut days later, but his journey started at a tender age through the visionary eyes of his father. “It started with my father, he was a cricketer, he still plays but not as much. He always told me that he would teach me all that he could to ensure that I would become more than just the ordinary player.” The elegant right hander admitted that he was forced into the game but realized he could maximize his potential given that he could make a living from the game and recalls some of the sacrifices his father made. “He took me out of junior cricket in St Maarten at an early age, deciding that it was more beneficial for me to train and play with grown men, rather than my Under-15 counterparts. This ensured that I was exposed to more advanced training, which quickly proved to be the right decision.” Carty’s name was on the top of everyone’s lips in 2016 when he hit a patient and match defining half century to guide the West Indies to their first ever Under-19 title in Bangladesh. He then matriculated into the Leeward Islands team the same year, however, he took him another six years to be called up to the West Indies squad. This called for patience and belief but there was never self doubt from the right-handed batter. “I was never worried about getting to the senior level, but I questioned myself a little wondering if I was good enough, but after you gradually start to reap some of the rewards of your hard work you start to tell yourself you can do it.” Keacy Carty has been fearless throughout his emerging journey, and now during his senior stint, continues to show the value of having a strong drive and desire to succeed. This article was written by Jerome Foster, Content and Media Officer assigned to the West Indies Men’s Senior Team Previous Next KEACY CARTY: FOLLOWING HIS FATHER’S VISION; FULFILLING THEIR DREAM May 28, 2025, 4:41 p.m. Keacy Carty raises his bat after scoring 100 in 2nd ODI v Ireland BIRMINGHAM, England- Keacy Carty stormed into the history books of West Indies Cricket by becoming the joint, sixth highest scorer in history, with a breathtaking 170 against Ireland in the third and final one day international at Clontarf in Dublin. Carty marvelled the crowd with his sparkling stroke play consisting of 15 sumptuous fours and 8 crisp sixes which reassured his admirers of his emerging power, to go along with his classy touch and finesse at the crease. This innings ensured the West Indies carved out a 197-run win via the Duckworth Lewis Method. This knock followed a defiant and reassuring 102 in the previous contest, after the West Indies found themselves wobbling on 46 for 2, before posting an imposing 352 for 8 in the second game of the series, which was unfortunately abandoned to due to rain. Prior to these recent outstanding performances, Carty showed his prowess in 2024 by leading the West Indies in scoring with 560 runs at a staggering average of 62.22 in 11 innings, only bettered by Sri Lankans: Kusal Mendis, Pathum Nissanka and Charith Asalanka. Keacy playing a cover drive vs Ireland in the 3rd ODI Carty insists that his transformation in form stems from his attention to detail and his diligence. “After experiencing some success in Australia, I knew that I just needed to focus on improving my weaker areas, so I ensured that I put in the hours and time ahead of every series with strategic intent if I was to improve and evolve as a player, not only for myself but also the team in the wider scheme of things.” Head Coach Daren Sammy spoke glowingly about the batter’s emergence especially with his current role in the team. “When you think about the phrase ‘hard work brings rewards’, Keacy is definitely a reflection of that because the role that management has now given him, the way he has grabbed that opportunity and made the best out of it, it makes you happy.” As a fringe player in 2023, Carty watched from the sidelines as the West Indies missed out on qualification for the 50 over World Cup that year in India, and that it was that agonizing feeling which fuelled his commitment and temperament over the last 17 months. Keacy Carty celebrates his 2nd 100 v Ireland in the 3rd ODI “In that moment I knew, that if I ever had the opportunity, that I would never allow us to be in this position going forward ever again.” He shared. “It wasn’t good for the team, or the region, given that it’s the first that has ever happened and even though I was not a regular at the time, seeing the disappointment and sadness of the players made it painful and we are now on a path with a collective mindset to ensure it never happens again.” At age 25, Carty created history when he was selected to tour the Netherlands, becoming the first cricketer born in the island of St Maarten to make a West Indies squad. He went on to make his debut days later, but his journey started at a tender age through the visionary eyes of his father. “It started with my father, he was a cricketer, he still plays but not as much. He always told me that he would teach me all that he could to ensure that I would become more than just the ordinary player.” The elegant right hander admitted that he was forced into the game but realized he could maximize his potential given that he could make a living from the game and recalls some of the sacrifices his father made. “He took me out of junior cricket in St Maarten at an early age, deciding that it was more beneficial for me to train and play with grown men, rather than my Under-15 counterparts. This ensured that I was exposed to more advanced training, which quickly proved to be the right decision.” Carty’s name was on the top of everyone’s lips in 2016 when he hit a patient and match defining half century to guide the West Indies to their first ever Under-19 title in Bangladesh. He then matriculated into the Leeward Islands team the same year, however, he took him another six years to be called up to the West Indies squad. This called for patience and belief but there was never self doubt from the right-handed batter. “I was never worried about getting to the senior level, but I questioned myself a little wondering if I was good enough, but after you gradually start to reap some of the rewards of your hard work you start to tell yourself you can do it.” Keacy Carty has been fearless throughout his emerging journey, and now during his senior stint, continues to show the value of having a strong drive and desire to succeed. This article was written by Jerome Foster, Content and Media Officer assigned to the West Indies Men’s Senior Team"
  },
  {
    "title": "#UCLfinal",
    "initial_info_desc": "Daily Twitter trend in india: #UCLfinal. Listed on 01/06/2025.",
    "source_name": "Twitter (via www.twitter-trending.com)",
    "content_type": "Social Trend",
    "geo_region": "in",
    "meta_data": {
      "rank": 4,
      "tweet_volume_display": "N/A",
      "collected_at": "2025-06-01 11:14:27 UTC",
      "scraper_list_date": "01/06/2025",
      "period": "Daily",
      "url": "https://www.twitter-trending.com/redirect?s=%2523UCLfinal",
      "platform": "Twitter",
      "link_to_trend_list": "https://www.twitter-trending.com/india/en",
      "hashtags": [
        "#UCLfinal"
      ]
    },
    "full_text_content_for_llm": "Trending topic on Twitter in in: '#UCLfinal'. Listed on 01/06/2025 for the Daily period. Tweet volume: N/A."
  },
  {
    "title": "viral videos",
    "initial_info_desc": "Google Trend: 'viral videos'. Related: Watch: Goa crow shows off football skills, internet wants to sign him up",
    "source_name": "Google Trends (trendspy)",
    "content_type": "Search Trend",
    "geo_region": "IN",
    "meta_data": {
      "rank": 3,
      "query": "viral videos",
      "collected_at": "2025-06-01 11:14:20 UTC",
      "related_news": [
        {
          "title": "Watch: Goa crow shows off football skills, internet wants to sign him up",
          "source": "Times of India",
          "url": "https://timesofindia.indiatimes.com/india/watch-goa-crow-shows-off-football-skills-internet-wants-to-sign-him-up/articleshow/121545709.cms"
        },
        {
          "title": "Crow plays football with kid in South Goa, video goes viral: netizens ask ‘need a striker’?",
          "source": "The Indian Express",
          "url": "https://indianexpress.com/article/trending/trending-in-india/crow-play-football-with-boy-in-south-goa-viral-video-10040317/"
        },
        {
          "title": "Watch: &apos;Crownaldo&apos; In The House, Crow Plays Football With A Kid In Viral Video",
          "source": "Republic World",
          "url": "https://www.republicworld.com/viral/watch-crownaldo-is-in-the-house-crow-plays-football-with-a-kid-in-viral-video"
        }
      ],
      "url": "https://timesofindia.indiatimes.com/india/watch-goa-crow-shows-off-football-skills-internet-wants-to-sign-him-up/articleshow/121545709.cms"
    },
    "full_text_content_for_llm": "Edition IN IN US English English à¤¹à¤¿à¤¨à¥à¤¦à¥ à¤®à¤°à¤¾à¤ à¥ à²à²¨à³à²¨à²¡ à®¤à®®à®¿à®´à¯ à¦¬à¦¾à¦à¦²à¦¾ à´®à´²à´¯à´¾à´³à´ à°¤à±à°²à±à°à± àªà«àªàª°àª¾àª¤à« Sign In TOI Today's ePaper News Watch: Goa crow shows off football skills, internet wants to sign him up Watch: Goa crow shows off football skills, internet wants to sign him up TOI News Desk / TIMESOFINDIA.COM / Jun 01, 2025, 10:23 IST Share AA Text Size Small Medium Large A remarkable video from South Goa has captured the hearts of social media users, showcasing an extraordinary football match between a young boy and a crow. The bird skillfully uses its beak to pass the ball back and forth, creating an adorable and captivating display of interspecies teamwork. A Crow seen playing football (X/ thegoanonline) A crow in South Goa has become an overnight sensation after a video showed the bird playing football with a young boy using its beak to pass the ball back and forth. The viral clip shows the unlikely duo engaged in what can only be described as the most adorable match ever. The boy gently kicks the ball toward his feathered teammate, who taps it back with precision using its beak. The video was originally shared by @thegoanonline on X, which was reposted by @chakdefootball on Instagram with the caption: \"In a rare video, a crow is seen playing football with a child somewhere in South Goa. How beautiful is this?\" Social media users are absolutely loving it. Comments range from \"Need a striker?\" to âCrownaldoâ. Sometimes the best entertainment comes from the simplest moments: a boy, a bird, and a ball creating magic that the entire internet can't stop watching. About the Author TOI News Desk The TOI News Desk comprises a dedicated and tireless team of journalists who operate around the clock to deliver the most current and comprehensive news and updates to the readers of The Times of India worldwide. With an unwavering commitment to excellence in journalism, our team is at the forefront of gathering, verifying, and presenting breaking news, in-depth analysis, and insightful reports on a wide range of topics. The TOI News Desk is your trusted source for staying informed and connected to the ever-evolving global landscape, ensuring that our readers are equipped with the latest developments that matter most.\" End of Article Follow Us On Social Media Visual Stories 8 ways to make your breakfast dosa support weight loss Food Anju Kurian steals the spotlight Entertainment Manushi Chhillar looks ethereal in traditional drapes Entertainment Samantha Ruth Prabhu to Sreeleela: Best PICS of the week of south actresses! Entertainment Photostories These 5 fruits beat sugar cravings without spiking sugar 5 best yoga poses to lose extra body weight and improve concentration Dol Ashram: The home to the world's largest Shri Yantra Farting can reduce your blood pressure, says science Hot Picks India Pakistan Ceasefire Top Trending Shanghai E Prix Schedule Tired of too many ads? go ad free now Trending Stories In Section Entire Website 1st Unofficial Test: England Lions 237/2 at stumps on Dy 2, trail India A by 320 runs 'Numbers not important, rectified tactical mistakes': CDS Anil Chauhan on Pakistan's claim of downing India jets during Operation Sindoor India lost jets but changed tactics to hit Pakistan hard: CDS M K Stalin visits estranged brother Alagiri in Madurai Earthquake of magnitute 6.1 strikes Japan 'Overreach': Indian-origin Megha Vemuri reacts to MIT's ban on her from commencement event for pro-Palestine speech US Speaker reacts to Indian-American Megha Vemuri's pro-Palestine speech: 'Have your children avoid MIT' IPL 2025: Will rain affect PBKS vs MI Qualifier 2 in Ahmedabad? Instagram influencer Sharmishtha Panoli sent to 14-day judicial custody; BJP accuses TMC of âappeasement politics' Uttam demands transparency on âRafale losses' 1st Unofficial Test: England Lions 237/2 at stumps on Dy 2, trail India A by 320 runs 'Numbers not important, rectified tactical mistakes': CDS Anil Chauhan on Pakistan's claim of downing India jets during Operation Sindoor India lost jets but changed tactics to hit Pakistan hard: CDS M K Stalin visits estranged brother Alagiri in Madurai Earthquake of magnitute 6.1 strikes Japan 'Overreach': Indian-origin Megha Vemuri reacts to MIT's ban on her from commencement event for pro-Palestine speech US Speaker reacts to Indian-American Megha Vemuri's pro-Palestine speech: 'Have your children avoid MIT' IPL 2025: Will rain affect PBKS vs MI Qualifier 2 in Ahmedabad? Instagram influencer Sharmishtha Panoli sent to 14-day judicial custody; BJP accuses TMC of âappeasement politics' Uttam demands transparency on âRafale losses' Tired of too many ads? go ad free now Explore Every Corner Across The Globe Dwyane Wade Daughter Baba Vanga Predictions Stephen Curry Stefon Digg Travis Kelce XXXTentacion Fortnite Collaboration Savannah James Jalen Brunson Travis Hunter Champions League Final MI vs PBKS High Income Skills IPL Match Today JEE Advanced Result Auston Matthews Olivia Dunne Juan Soto Influencer Sharmishtha Panoli Bengaluru truck driver murder Odisha Chief Engineer Raid Asim Munir Katie Miller Cheteshwar Pujara Covid 19 in India JAC 12th Toppers Donald Trump Travis Hunter Wife Zion Williamson Girlfriend PERA CET Result 2025 Donald Trump About us Create Your Own Ad Terms of Use and Grievance Redressal Policy Privacy policy Advertise with us RSS Newsletter Feedback ePaper Sitemap Archives Living and Entertainment Cricbuzz Lifestyle Newspaper Subscription Food News TV Times Prime Travel Destinations Whats Hot ETimes Times Life Times Pets MyLifeXP Services CouponDunia TechGig TimesJobs Bollywood News Times Mobile Gadgets Work with Us Colombia Hot on the Web Liver Detox Fruits Tsunami Wave Exercise Benefits Heart Attacks Kidney Detox Foods High Cholesterol Symptoms Delhi Metro Vitamin D Supplements Saba Ibrahim Samay Raina Unique Animals Magnesium Deficiency Symptoms Anaconda River Baby Girl Names Prostate Cancer The Traitors Review Heart Attacks National Parks Optical illusion Baby Girl Names Uric Acid Chinese Herbs For Hair Tiger Reserve India Liver Detox Veggies Aspergillus Fungus Vegetarian Foods Sharmin Segal Vishnu Manchu Turmeric For Liver Disease Bhool Chuk Maaf Collection Gta 6 Deadliest Cobras Japanese Walking Technique Non Poisonous Snakes Elon Musk Exit Doge Birth Month Reveals About Your Life Jensen Huang One Piece Live Action Season 2 Jensen Huang Net Worth Shonen Manga Grimes Katie Miller Trending Topics Hardik Pandya Luis Enrique PSG Champions League AP DSC Hall Ticket BSEB Compartment Result Tips to Boost Memory PM Modi Jasprit Bumrah PBKS vs MI Yuzvendra Chahal RRB NTPC Admit Card Taylor Swift New York Knicks vs Indiana Pacers Pascal Siakam Cardi B Josh Allen Aaron Rodger Jalen Ramsey Next Gen Fighter Jets Operation Sindoor Nitish Kumar Megha Vemuri Covid 19 Patient Audio Clip Case Mamata Banerjee Article 370 Dwyane Wade Daughter Stefon Diggs NFL Rumor Gujarat Titans AC Discharge Nyt Strands Today Garena Free Fire Max Wordle Today NYT Connections Hints Mammoth Vs Elephant Sunita Williams Jeff Bezos Elon Musk Apple iPhone 15 Linkedin Lays Off Tesla Hiring Drivers Popular Categories Headlines Sports News Business News India News World News Bollywood News Health+ Tips Indian TV Shows Technology Travel Etimes Health & Fitness WWE NFL IPL Playoffs Astrology Weather Today IPL Anime June Bank Holidays Public Holidays in June IPL Teams Stock Market Holidays NSE Holidays BSE Holidays Power Creator Awards Technology News International Sports Public Holidays Bank Holidays Latest News When Paresh Rawal admitted feeling trapped as Baburao in âHera Pheri': âI need mukti from that role' Bulgarian nationalists march against euro currency adoption The right way to massage your face to get rid of the double chin Punjab Kings' biggest challenge: How to survive 'possessed' Jasprit Bumrah's 24 deliveries 'Narivetta' Box Office Collection Day 9: Tovino Thomas starrer mints Rs 11.68 crore Florida mother arrested after dead kid found in bed 12 days after 'demon exorcism' Caitlin Clark gives an epic reaction reaction to Tyrese Haliburton in Indiana Pacers Game 6 win against New York Knicks [See video] TimothÃ©e Chalamet and Kylie Jenner add sparkle to Gainbridge Fieldhouse as Indiana Pacers eliminate New York Knicks Nigeria: Death toll from major floods passes 150 Exclusive! Pooja Hegde on her flops: We are actors, we have to be allowed to fail Hamas agrees to free 10 hostages alive; says war must end How to use Patanjali's 'Dharti ka Chaukidar': A product for increasing the purity of soil 5 seaside towns in India where the seafood steals the show Leo Monthly Predictions for June 2025: Avoid financial risks; celebrate achievements and recharge Weekly Chinese Horoscope, June 1 to June 7, 2025: 5 zodiacs that are lucky âHe's done everything rightâ: Cam Newton addresses harsh treatment of Travis Hunter's wife online Judge to Google asking not to restrict its reach in AI: What you are telling is â¦ 8 proven strategies to double your income and increase your employability Copyright Â© 2025 Bennett, Coleman & Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service Follow Us On"
  },
  {
    "title": "rodrygo goes",
    "initial_info_desc": "Google Trend: 'rodrygo goes'. Related: Rodrygo dice al Real Madrid que se quiere quedar, pero le piden reacción",
    "source_name": "Google Trends (trendspy)",
    "content_type": "Search Trend",
    "geo_region": "IN",
    "meta_data": {
      "rank": 5,
      "query": "rodrygo goes",
      "collected_at": "2025-06-01 11:14:20 UTC",
      "related_news": [
        {
          "title": "Rodrygo dice al Real Madrid que se quiere quedar, pero le piden reacción",
          "source": "MARCA",
          "url": "https://www.marca.com/futbol/real-madrid/2025/05/31/rodrygo-dice-real-madrid-quiere-quedar-le-piden-reaccion.html"
        },
        {
          "title": "Florentino Pérez comunica a Xabi Alonso que no vendrá, no ha hay nada que hacer, el Real Madrid tira la toalla",
          "source": "Don Balón",
          "url": "https://www.donbalon.com/futbol/realmadrid/florentino-perez-comunica-a-xabi-alonso-que-no-vendra-no-ha-hay-nada-que-hacer-el-real-madrid-tira-la-toalla"
        },
        {
          "title": "Rumores y noticias de fichajes: Arsenal y Chelsea, atentos a Rodrygo",
          "source": "ESPN Deportes",
          "url": "https://espndeportes.espn.com/futbol/nota/_/id/15251994/fichajes-rumores-noticias-arsenal-chelsea-atentos-rodrygo-real-madrid"
        }
      ],
      "url": "https://www.marca.com/futbol/real-madrid/2025/05/31/rodrygo-dice-real-madrid-quiere-quedar-le-piden-reaccion.html"
    },
    "full_text_content_for_llm": "Real Madrid Rodrygo dice al Real Madrid que se quiere quedar, pero le piden reacción Tiene 45 días y un Mundial por delante para despejar dudas y demostrar que puede entrar de lleno en el proyecto de Xabi Alonso Rodrygo, entrando en el Bernabéu antes el partido ante el Arsenal JOSÉ FÉLIX DÍAZ Actualizado 31/05/2025 - 13:52 CEST Compartir en Facebook Compartir en Twitter Compartir en Telegram Compartir en Whatsapp Compartir por Mail Real Madrid. Vallejo deja el Real Madrid y no disputará el Mundial de Clubes Real Madrid. Roberto Carlos: \"Con Ancelotti tenemos al mejor entrenador para volver a ganar un Mundial\" El pasado 26 mayo fue titular en La Cartuja ante el Barcelona en la final de Copa del Rey. En el descanso fue sustituido y desde ese momento, no se le ha vuelto a ver con la camiseta del Real Madrid. Se dejó ver en el entrenamiento previo al partido ante el Mallorca, pero una lesión (nunca ha habido parte médico de la misma) , impidió a Rodrygo volver a jugar partido alguno. La selección brasileña, ahora dirigida por Ancelotti, tampoco le ha llamado para el estreno del italiano y según fuentes de la CBF 'para ayudar a recuperar el tono físico y anímico', en ningún momento han hablado de lesión. El lunes, y con Xabi Alonso a los mandos, el Real Madrid inicia una nueva etapa y lo que han hecho los dirigentes del club blanco (han estado al lado del delantero en todo momento), es preguntar sobre su deseo e idea cara al futuro . La respuesta del brasileños no ha dejado lugar a duda alguna y en su cabeza está la idea de continuar vistiendo de blanco pese a todos los rumores existentes sobre su futuro. La urgencia se lleva todo por delante Incluso en la despedida de Carlo Ancelotti, le confirmó, además de que quiere seguir bajo sus órdenes en la selección brasileña, que su idea es la de seguir en el Real Madrid, algo que ha trasladado a Florentino Pérez y José Ángel Sánchez en estos últimos días. Cierto es que semanas antes confesó al cuerpo técnico que no se sentía con fuerza para dejarse ver en el Clásico que sentenció LaLiga, pero su mensaje de ahora es diferente. En Valdebebas están inquietos. Saben del potencial de Rodrygo, pero también han comprobado como se ha caído a partir del mes de febrero. En todo momento, técnicos y dirigentes han estado apoyando y de lado del ex de Santos, pero también le han pedido una reacción, gestos de que se puede enganchar otra vez de manera rápida a la dinámica que exige el Real Madrid. Rodrygo se retira del entrenamiento antes del partido ante el Mallorca. EFE Xabi Alonso, tal cual dijo en rueda de prensa, cuenta con él, como cuenta con todos, pero ahora uno y otro tienen la misión de conocerse y que Rodrygo vuelva a dar la mejor posible durante el Mundial de clubes. Por delante, 45 días en los que debe convencer a todos , empezando por él mismo, de que su sitio es el Real Madrid y eso pasa por recuperar la energía, ya que fútbol ha demostrado en muchas ocasiones que lo tiene. El nuevo técnico madridista explica que es lo que quiere en su equipo Sin ofertas en Valdebebas Se ha hablado y mucho, pero por el momento no ha llegado propuesta alguna en relación al futuro de Rodrygo. El mercado arranca el lunes, pero no será hasta el verano en el momento en el que se puedan producir movimiento alrededor de un futbolista que de momento no ha trasladado el interés de marcharse. Más bien todo lo contrario, pero que también sabe que debe dar el golpe en la mesa y recuperar el terreno perdido. Real Madrid Rodrygo Goes Florentino Pérez Rodríguez Carlo Ancelotti Xabi Alonso Real Madrid Figo: \"El Madrid tiene que aprender la lección y fichar para mejorar\" Real Madrid Roberto Carlos: \"Con Ancelotti tenemos al mejor entrenador para volver a ganar un Mundial\" Real Madrid Diego Aguado y Fortea, al Mundial de Clubes con Xabi Alonso Últimas Noticias Ver más 13:53 Rodrygo dice al Real Madrid que se quiere quedar, pero le piden reacción 13:25 El motivo por el que Di María no acompañará a Messi en Miami, según Mascherano 13:19 Los otros nombres del verano txuriurdin 13:10 Torres: \"Independientemente de los resultados, hay una autocrítica muy grande\" 13:25 Sitúan a Morata en la órbita de Getafe y Sevilla Real Madrid Rodrygo dice al Real Madrid que se quiere quedar, pero le piden reacción Tiene 45 días y un Mundial por delante para despejar dudas y demostrar que puede entrar de lleno en el proyecto de Xabi Alonso Rodrygo, entrando en el Bernabéu antes el partido ante el Arsenal JOSÉ FÉLIX DÍAZ Actualizado 31/05/2025 - 13:52 CEST Compartir en Facebook Compartir en Twitter Compartir en Telegram Compartir en Whatsapp Compartir por Mail Real Madrid. Vallejo deja el Real Madrid y no disputará el Mundial de Clubes Real Madrid. Roberto Carlos: \"Con Ancelotti tenemos al mejor entrenador para volver a ganar un Mundial\" El pasado 26 mayo fue titular en La Cartuja ante el Barcelona en la final de Copa del Rey. En el descanso fue sustituido y desde ese momento, no se le ha vuelto a ver con la camiseta del Real Madrid. Se dejó ver en el entrenamiento previo al partido ante el Mallorca, pero una lesión (nunca ha habido parte médico de la misma) , impidió a Rodrygo volver a jugar partido alguno. La selección brasileña, ahora dirigida por Ancelotti, tampoco le ha llamado para el estreno del italiano y según fuentes de la CBF 'para ayudar a recuperar el tono físico y anímico', en ningún momento han hablado de lesión. El lunes, y con Xabi Alonso a los mandos, el Real Madrid inicia una nueva etapa y lo que han hecho los dirigentes del club blanco (han estado al lado del delantero en todo momento), es preguntar sobre su deseo e idea cara al futuro . La respuesta del brasileños no ha dejado lugar a duda alguna y en su cabeza está la idea de continuar vistiendo de blanco pese a todos los rumores existentes sobre su futuro. La urgencia se lleva todo por delante Incluso en la despedida de Carlo Ancelotti, le confirmó, además de que quiere seguir bajo sus órdenes en la selección brasileña, que su idea es la de seguir en el Real Madrid, algo que ha trasladado a Florentino Pérez y José Ángel Sánchez en estos últimos días. Cierto es que semanas antes confesó al cuerpo técnico que no se sentía con fuerza para dejarse ver en el Clásico que sentenció LaLiga, pero su mensaje de ahora es diferente. En Valdebebas están inquietos. Saben del potencial de Rodrygo, pero también han comprobado como se ha caído a partir del mes de febrero. En todo momento, técnicos y dirigentes han estado apoyando y de lado del ex de Santos, pero también le han pedido una reacción, gestos de que se puede enganchar otra vez de manera rápida a la dinámica que exige el Real Madrid. Rodrygo se retira del entrenamiento antes del partido ante el Mallorca. EFE Xabi Alonso, tal cual dijo en rueda de prensa, cuenta con él, como cuenta con todos, pero ahora uno y otro tienen la misión de conocerse y que Rodrygo vuelva a dar la mejor posible durante el Mundial de clubes. Por delante, 45 días en los que debe convencer a todos , empezando por él mismo, de que su sitio es el Real Madrid y eso pasa por recuperar la energía, ya que fútbol ha demostrado en muchas ocasiones que lo tiene. El nuevo técnico madridista explica que es lo que quiere en su equipo Sin ofertas en Valdebebas Se ha hablado y mucho, pero por el momento no ha llegado propuesta alguna en relación al futuro de Rodrygo. El mercado arranca el lunes, pero no será hasta el verano en el momento en el que se puedan producir movimiento alrededor de un futbolista que de momento no ha trasladado el interés de marcharse. Más bien todo lo contrario, pero que también sabe que debe dar el golpe en la mesa y recuperar el terreno perdido. Real Madrid Rodrygo Goes Florentino Pérez Rodríguez Carlo Ancelotti Xabi Alonso Real Madrid Figo: \"El Madrid tiene que aprender la lección y fichar para mejorar\" Real Madrid Roberto Carlos: \"Con Ancelotti tenemos al mejor entrenador para volver a ganar un Mundial\" Real Madrid Diego Aguado y Fortea, al Mundial de Clubes con Xabi Alonso Últimas Noticias Ver más 13:53 Rodrygo dice al Real Madrid que se quiere quedar, pero le piden reacción 13:25 El motivo por el que Di María no acompañará a Messi en Miami, según Mascherano 13:19 Los otros nombres del verano txuriurdin 13:10 Torres: \"Independientemente de los resultados, hay una autocrítica muy grande\" 13:25 Sitúan a Morata en la órbita de Getafe y Sevilla FUTBOL Real Madrid Rodrygo dice al Real Madrid que se quiere quedar, pero le piden reacción Tiene 45 días y un Mundial por delante para despejar dudas y demostrar que puede entrar de lleno en el proyecto de Xabi Alonso Rodrygo, entrando en el Bernabéu antes el partido ante el Arsenal JOSÉ FÉLIX DÍAZ Actualizado 31/05/2025 - 13:52 CEST Compartir en Facebook Compartir en Twitter Compartir en Telegram Compartir en Whatsapp Compartir por Mail Real Madrid. Vallejo deja el Real Madrid y no disputará el Mundial de Clubes Real Madrid. Roberto Carlos: \"Con Ancelotti tenemos al mejor entrenador para volver a ganar un Mundial\" El pasado 26 mayo fue titular en La Cartuja ante el Barcelona en la final de Copa del Rey. En el descanso fue sustituido y desde ese momento, no se le ha vuelto a ver con la camiseta del Real Madrid. Se dejó ver en el entrenamiento previo al partido ante el Mallorca, pero una lesión (nunca ha habido parte médico de la misma) , impidió a Rodrygo volver a jugar partido alguno. La selección brasileña, ahora dirigida por Ancelotti, tampoco le ha llamado para el estreno del italiano y según fuentes de la CBF 'para ayudar a recuperar el tono físico y anímico', en ningún momento han hablado de lesión. El lunes, y con Xabi Alonso a los mandos, el Real Madrid inicia una nueva etapa y lo que han hecho los dirigentes del club blanco (han estado al lado del delantero en todo momento), es preguntar sobre su deseo e idea cara al futuro . La respuesta del brasileños no ha dejado lugar a duda alguna y en su cabeza está la idea de continuar vistiendo de blanco pese a todos los rumores existentes sobre su futuro. La urgencia se lleva todo por delante Incluso en la despedida de Carlo Ancelotti, le confirmó, además de que quiere seguir bajo sus órdenes en la selección brasileña, que su idea es la de seguir en el Real Madrid, algo que ha trasladado a Florentino Pérez y José Ángel Sánchez en estos últimos días. Cierto es que semanas antes confesó al cuerpo técnico que no se sentía con fuerza para dejarse ver en el Clásico que sentenció LaLiga, pero su mensaje de ahora es diferente. En Valdebebas están inquietos. Saben del potencial de Rodrygo, pero también han comprobado como se ha caído a partir del mes de febrero. En todo momento, técnicos y dirigentes han estado apoyando y de lado del ex de Santos, pero también le han pedido una reacción, gestos de que se puede enganchar otra vez de manera rápida a la dinámica que exige el Real Madrid. Rodrygo se retira del entrenamiento antes del partido ante el Mallorca. EFE Xabi Alonso, tal cual dijo en rueda de prensa, cuenta con él, como cuenta con todos, pero ahora uno y otro tienen la misión de conocerse y que Rodrygo vuelva a dar la mejor posible durante el Mundial de clubes. Por delante, 45 días en los que debe convencer a todos , empezando por él mismo, de que su sitio es el Real Madrid y eso pasa por recuperar la energía, ya que fútbol ha demostrado en muchas ocasiones que lo tiene. El nuevo técnico madridista explica que es lo que quiere en su equipo Sin ofertas en Valdebebas Se ha hablado y mucho, pero por el momento no ha llegado propuesta alguna en relación al futuro de Rodrygo. El mercado arranca el lunes, pero no será hasta el verano en el momento en el que se puedan producir movimiento alrededor de un futbolista que de momento no ha trasladado el interés de marcharse. Más bien todo lo contrario, pero que también sabe que debe dar el golpe en la mesa y recuperar el terreno perdido. Real Madrid Rodrygo Goes Florentino Pérez Rodríguez Carlo Ancelotti Xabi Alonso Real Madrid Figo: \"El Madrid tiene que aprender la lección y fichar para mejorar\" Real Madrid Roberto Carlos: \"Con Ancelotti tenemos al mejor entrenador para volver a ganar un Mundial\" Real Madrid Diego Aguado y Fortea, al Mundial de Clubes con Xabi Alonso Últimas Noticias Ver más 13:53 Rodrygo dice al Real Madrid que se quiere quedar, pero le piden reacción 13:25 El motivo por el que Di María no acompañará a Messi en Miami, según Mascherano 13:19 Los otros nombres del verano txuriurdin 13:10 Torres: \"Independientemente de los resultados, hay una autocrítica muy grande\" 13:25 Sitúan a Morata en la órbita de Getafe y Sevilla Comentarios Danos tu opinión"
  },
  {
    "title": "#FundKaveriEngine",
    "initial_info_desc": "Weekly Twitter trend in india: #FundKaveriEngine. Listed on June 2025.",
    "source_name": "Twitter (via www.twitter-trending.com)",
    "content_type": "Social Trend",
    "geo_region": "in",
    "meta_data": {
      "rank": 5,
      "tweet_volume_display": "N/A",
      "collected_at": "2025-06-01 11:14:27 UTC",
      "scraper_list_date": "June 2025",
      "period": "Weekly",
      "url": "https://www.twitter-trending.com/redirect?s=%2523FundKaveriEngine",
      "platform": "Twitter",
      "link_to_trend_list": "https://www.twitter-trending.com/india/en",
      "hashtags": [
        "#FundKaveriEngine"
      ]
    },
    "full_text_content_for_llm": "Trending topic on Twitter in in: '#FundKaveriEngine'. Listed on June 2025 for the Weekly period. Tweet volume: N/A."
  },
  {
    "title": "kerala lottery result yesterday",
    "initial_info_desc": "Google Trend: 'kerala lottery result yesterday'. Related: [OUT] Kerala Lottery Result Today 01-06-2025 LIVE: Samrudhi SM 5 Bumper Sunday Lucky Draw DECLARED - 1 Crore First Prize, Check Full Winners List",
    "source_name": "Google Trends (trendspy)",
    "content_type": "Search Trend",
    "geo_region": "IN",
    "meta_data": {
      "rank": 6,
      "query": "kerala lottery result yesterday",
      "collected_at": "2025-06-01 11:14:20 UTC",
      "related_news": [
        {
          "title": "[OUT] Kerala Lottery Result Today 01-06-2025 LIVE: Samrudhi SM 5 Bumper Sunday Lucky Draw DECLARED - 1 Crore First Prize, Check Full Winners List",
          "source": "Zee News",
          "url": "https://zeenews.india.com/india/live-updates/kerala-lottery-result-today-01-06-2025-samrudhi-sm-4-bumper-sunday-lucky-draw-results-out-at-3-pm-1-crore-first-prize-check-full-winners-list-2909250.html"
        },
        {
          "title": "Kerala Lottery Results: Karunya KR-708 Winners For May 31, 2025; First Prize Rs 1 Crore!",
          "source": "News18",
          "url": "https://www.news18.com/india/kerala-lottery-results-today-live-updates-karunya-kr-708-winners-list-for-31-may-2025-9358193.html"
        },
        {
          "title": "Vishu Bumper BR-103 Kerala Lottery Result 2025: First Prize for ticket VD 204266 | Check full list of winners",
          "source": "Onmanorama",
          "url": "https://www.onmanorama.com/news/kerala/2025/05/28/kerala-vishu-bumper-lottery-results-br-103-first-prize-full-list-winners.html"
        }
      ],
      "url": "https://zeenews.india.com/india/live-updates/kerala-lottery-result-today-01-06-2025-samrudhi-sm-4-bumper-sunday-lucky-draw-results-out-at-3-pm-1-crore-first-prize-check-full-winners-list-2909250.html"
    },
    "full_text_content_for_llm": "Advertisement X trendingNow english 2909250 https://zeenews.india.com/india/live-updates/kerala-lottery-result-today-01-06-2025-samrudhi-sm-4-bumper-sunday-lucky-draw-results-out-at-3-pm-1-crore-first-prize-check-full-winners-list-2909250.html News India KERALA LOTTERY RESULT TODAY [OUT] Kerala Lottery Result Today 01-06-2025 LIVE: Samrudhi SM 5 Bumper Sunday Lucky Draw DECLARED - 1 Crore First Prize, Check Full Winners List KERALA LOTTERY RESULT SUNDAY 01-06-2025 LIVE: The Kerala Lottery result for the \" Samrudhi SM \" draw on Sunday, June 01, 2025, is scheduled to be announced live at 3 PM. This lottery draw is part of the seven weekly draws held in Kerala. The alphanumeric code assigned to this specific lottery is \"SM,\" incorporating both the draw number and the code. The first prize for the fortunate winner of this draw is a bumper 1 Crore rupees. Below, you can find the comprehensive list of winners for the Kerala 'Samrudhi SM 4' lottery draw. Written By Zee Media Bureau | Last Updated: Jun 01, 2025, 03:54 PM IST | Source: Follow Us Trending Photos 7 Miss World winner From Surviving Breast Surgery At 16 To Making History: Meet Opal Suchata Chuangsri, Miss World 2025 12 IPL 2025 IPL 2025 Qualifier 2: Mumbai Indians' Predicted Playing XI Against Punjab Kings; Richard Gleeson OUT, Deepak Chahar IN; This Bowler To Come As Impact Player 7 Rohit Sharma Most Sixes In IPL History: Rohit Sharma Emulates Chris Gayle; Check List Featuring Top 7 Batters 13 WEEKLY HEALTH HOROSCOPE Weekly Health Horoscope For June 1-8: You’re Feeling Strong But May Neglect Sleep, Check Your Health TIP For The Week Kerala Lottery Result Today LIVE LIVE Blog Kerala Lottery Results Sunday 01-06-2025 LIVE: The much-anticipated Kerala Samrudhi SM 4 Bumper Lottery result has been declared today by the Kerala State Lottery Department. The lucky draw for the Samrudhi SM 4 lottery was held at 2 PM today Sunday June 01, at Gorky Bhavan, near Bakery Junction, Thiruvananthapuram. The first prize winner will take home a whopping ₹1 Crore. The Samrudhi lottery is one of the seven weekly lotteries conducted by the Government of Kerala and is held every Sunday. Each ticket costs ₹50, and the draw is represented by the code “SM”, followed by the draw number. The live results and full list of winning numbers for Samrudhi SM.4 Bumper Draw are now available. Check if you’re among the lucky winners below: Kerala Lottery Result 01-06-2025 JUNE: FULL LIST OF WINNING NUMBERS FOR SAMRUDHI SM 4 BUMPER Draw LUCKY NUMBER FOR 1ST PRIZE OF RS 1 CRORE IS: ME 301061 LUCKY NUMBER FOR 2ND PRIZE OF RS 75 LAKHS IS: MK 442044 LUCKY NUMBERS FOR 3RD PRIZE OF RS 25 Lakh ARE: MG 313753 LUCKY NUMBERS FOR CONSOLATION PRIZE OF RS 5,000 ARE: MA 301061 MB 301061 MC 301061 MD 301061 MF 301061 MG 301061 MH 301061 MJ 301061 MK 301061 ML 301061 MM 301061 (For The Tickets Ending with The Following Numbers below) LUCKY NUMBERS FOR 4TH PRIZE OF RS 1 LAKH ARE: MA 812076 MB 385451 MC 134114 MD 475812 ME 137466 MF 250447 MG 350917 MH 854434 MJ 316836 MK 723136 ML 429212 MM 493366 LUCKY NUMBERS FOR 5TH PRIZE OF RS 5,000 ARE: 0783 1005 1055 1586 2243 2282 2946 3623 4568 5125 5258 5513 5757 6966 8611 9412 9739 9894 LUCKY NUMBERS FOR 6TH PRIZE OF RS 1,000 ARE: 0529 0569 1251 1539 1620 2285 2287 2701 2908 3537 3832 4182 4278 4699 4858 5037 5255 5447 5817 6052 6982 7523 7802 8550 8907 8941 9209 9258 9772 9806 LUCKY NUMBERS FOR 7TH PRIZE OF RS 500 ARE: 0161 0439 0547 0570 0586 0639 0719 0982 1310 1359 1623 1635 1822 1839 2045 2147 2165 2270 2292 2564 2594 2631 2708 2861 2924 2927 3071 3398 3520 3769 3778 3826 3869 4019 4026 4192 4211 4272 4296 4370 4394 4429 4504 4505 4567 4677 4692 4698 4765 4795 4877 4889 4997 5002 5189 5303 5558 5644 5798 5867 5918 6002 6040 6333 6443 6566 6669 6710 6726 6950 7061 7219 7309 7564 7678 7760 7768 7884 7900 7977 8017 8077 8089 8108 8159 8261 8277 8410 8555 8565 8619 8620 8800 8823 8917 9039 9055 9403 9438 9702 9781 9886 LUCKY NUMBERS FOR 8TH PRIZE OF RS 100 ARE: To Be Announced LUCKY NUMBERS FOR 9TH PRIZE OF RS 50 ARE: To Be Announced KERALA LOTTERY RESULT 01-06-2025 JUNE TODAY: SAMRUDHI SM-4 BUMPER LOTTERY PRIZE DETAILS 1st Prize: ₹1,00,00,000 (1 Crore) 2nd Prize: ₹75,00,000 (75 Lakhs) 3rd Prize: ₹25,00,000 (25 Lakhs) 4th Prize: ₹1,00,000 5th Prize: ₹5,000 6th Prize: ₹1,000 7th Prize: ₹500 8th Prize: ₹100 9th Prize: ₹50 Consolation Prize: ₹5,000 (NOTE: Lottery can be addictive and should be played responsibly. The data provided on this page is for informational purposes only and should not be construed as advice or encouragement. Zee News does not promote lottery in anyway.) Stay Tuned To Zee News For Live And Latest Updates On Kerala Lottery Result 2025 01 June 2025 15:53 IST Kerala Lottery Result Today 01.06.2025 Live: Samrudhi SM 5 Bumper Lucky Draw Fourth Prize Winners 4th Prize Rs.1,00,000/- [1 Lakh] 1) MA 812076 2) MB 385451 3) MC 134114 4) MD 475812 5) ME 137466 6) MF 250447 7) MG 350917 8) MH 854434 9) MJ 316836 10) MK 723136 11) ML 429212 12) MM 493366 15:52 IST Kerala Lottery Result Today 01.06.2025 Live: Samrudhi SM 5 Bumper Lucky Draw Third Prize Winner - 3rd Prize Rs.25,00,000/- [25 Lakhs] - MG 313753 15:15 IST Kerala Lottery Result Today 01.06.2025 Live: Samrudhi SM 5 Bumper Lucky Draw Second Prize Winner - 2nd Prize Rs.75,00,000/- [75 Lakhs] - MK 442044 15:14 IST Kerala Lottery Result Today 01.06.2025 Live: Samrudhi SM 5 Bumper Lucky Draw First Prize Winner - 1st Prize Rs.1,00,00,000/- [1 Crore] - ME 301061 14:56 IST LIVE | Kerala Lottery Result 01.06.2025 Live: Keep Your Lottery Ticket Safe A ticket with multiple security features can prevent claims if damaged. So keep the ticket safe. Those who won the prize less than Rs.5000 should approach any lottery shop in Kerala with the ticket to collect the amount. If the prize is more than 5000 then the ticket and identity documents should be brought to any bank or government lottery office. 14:55 IST Kerala Lottery Result Today 01.06.2025 Live: Samrudhi SM 5 Bumper Sunday Lucky Draw Result DECLARED 14:17 IST LIVE | Kerala State Lottery Result Today: 7 Days Lottery The Akshaya Lottery is held on Sunday, the Win-Win Lottery is held on Monday, the Sthree Sakthi Lottery is held on Tuesday, the Fifty-Fifty Lottery is held on Wednesday, the Karunya Plus Lottery is held on Thursday, the Nirmal Lottery is held on Friday, and the Karunya Lottery is held on Saturday. Unfortunately, the government temporarily halted the sale of the Pournami lottery and introduced a new programme in the Monthly Lottery called Bhagyamithra Lottery. Live updates for the Kerala lottery results will start to appear from 3.05 pm on ZEE NEWS ENGLISH site. 13:16 IST LIVE | Kerala Lottery Result 01.06.2025 Live: Keep Your Lottery Ticket Safe A ticket with multiple security features can prevent claims if damaged. So keep the ticket safe. Those who won the prize less than Rs.5000 should approach any lottery shop in Kerala with the ticket to collect the amount. If the prize is more than 5000 then the ticket and identity documents should be brought to any bank or government lottery office. 12:27 IST LIVE | Kerala Lottery Result TODAY: Online Purchasing Of Ticket Stay tuned for live updates on the Kerala Lottery Result for June 01, 2025. It's crucial to note that online purchasing of Kerala lottery tickets is prohibited, carrying potential legal consequences. Engaging in such practices may lead to penalties imposed by legal authorities, as the state government strictly prohibits online selling and purchasing of lottery tickets. 11:56 IST Kerala Lottery Live Result Today 01.06.2025: Lottery Details The Kerala Lottery Result for Samrudhi SM 5 is set to be drawn today. The public can view the Winning Number post at 2.55 pm during the live broadcast of Kerala Lottery Today. The announcement for the Kerala Lotteries Result today, dated June 01 2025, is expected to follow shortly. Stay informed on all the latest news , real-time breaking news updates, and follow all the important headlines in india news and world News on Zee News. TAGS kerala lottery result today Samrudhi SM 4 Bumper Lucky Draw Kerala Lottery Result Sunday Kerala Lottery Sambad Result Kerala Lottery Result 01 June 2025 Kerala State Lottery Result Sunday Kerala lottery results today Kerala Lucky Draw Results June 1 Kerala Lottery Winner Samrudhi SM 4 Bumper Kerala Lottery Result 01.06.2025 kerala lottery Lucky Draw Result sunday Advertisement Advertisement Trending news Murshidabad Will Hindus get justice in Bengal's Murshidabad? DNA Video DNA: Uproar over freebies in Delhi! Shahrukh Pathan DNA: AIMIM plans to field 2020 Delhi riots accused Shahrukh Pathan DNA Video DNA: A report showing the reality of Bangladesh DNA Video DNA: Power Theft Allegations Against SP MP Ziaur Rahman Barq DNA Video DNA: Hot Tea Linked to Cancer Risk! DNA Video DNA: Why Jordan Fears After Syria’s Coup? DNA Video DNA: NSA Ajit Doval’s China Visit - Inside Story DNA Video DNA: Gandhi Family Ruined My Career, says Mani Shankar Aiyar DNA Video DNA: Ground Report- Tight Security Arrangements for Mahakumbh NEWS ON ONE CLICK"
  },
  {
    "title": "#RCBvsPBKS",
    "initial_info_desc": "Weekly Twitter trend in india: #RCBvsPBKS. Listed on June 2025.",
    "source_name": "Twitter (via www.twitter-trending.com)",
    "content_type": "Social Trend",
    "geo_region": "in",
    "meta_data": {
      "rank": 6,
      "tweet_volume_display": "N/A",
      "collected_at": "2025-06-01 11:14:27 UTC",
      "scraper_list_date": "June 2025",
      "period": "Weekly",
      "url": "https://www.twitter-trending.com/redirect?s=%2523RCBvsPBKS",
      "platform": "Twitter",
      "link_to_trend_list": "https://www.twitter-trending.com/india/en",
      "hashtags": [
        "#RCBvsPBKS"
      ]
    },
    "full_text_content_for_llm": "Trending topic on Twitter in in: '#RCBvsPBKS'. Listed on June 2025 for the Weekly period. Tweet volume: N/A."
  },
  {
    "title": "shai hope",
    "initial_info_desc": "Google Trend: 'shai hope'. Related: West Indies fined for slow over-rate in first England ODI",
    "source_name": "Google Trends (trendspy)",
    "content_type": "Search Trend",
    "geo_region": "IN",
    "meta_data": {
      "rank": 7,
      "query": "shai hope",
      "collected_at": "2025-06-01 11:14:20 UTC",
      "related_news": [
        {
          "title": "West Indies fined for slow over-rate in first England ODI",
          "source": "ICC",
          "url": "https://www.icc-cricket.com/news/west-indies-fined-for-slow-over-rate-in-first-england-odi"
        },
        {
          "title": "West Indies fined for slow over-rate against England in first ODI",
          "source": "Mint",
          "url": "https://www.livemint.com/sports/cricket-news/west-indies-fined-for-slow-over-rate-against-england-in-first-odi-11748775507625.html"
        },
        {
          "title": "West Indies Endure Continued Struggles In England as ICC Sanctions Them For Breach of Code In First ODI Match",
          "source": "Republic World",
          "url": "https://www.republicworld.com/cricket/west-indies-endure-continued-struggles-in-england-as-icc-sanctions-them-for-breach-of-code-in-first-odi-match"
        }
      ],
      "url": "https://www.icc-cricket.com/news/west-indies-fined-for-slow-over-rate-in-first-england-odi"
    },
    "full_text_content_for_llm": "The West Indies have been fined for maintaining a slow over-rate during the first ODI against England , held on Thursday, May 29, in Edgbaston, Birmingham. Match Referee Jeff Crowe of the Emirates ICC Elite Panel imposed a five per cent fine on each player’s match fee, after Shai Hope’s team was found to be one over short of the required target at the end of the innings, once time allowances were taken into consideration. The penalty is in line with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel , which pertains to minimum over-rate offences. As per ICC regulations, players are fined five per cent of their match fee for each over their side fails to bowl within the allotted time. View this post on Instagram A post shared by ICC (@icc) West Indies captain Shai Hope accepted the sanction to the offence, with a formal hearing not deemed necessary. The charge was levelled by on-field umpires Kumar Dharmasena and Martin Saggers, along with third umpire Adrian Holdstock and fourth umpire Graham Lloyd. England registered a massive 238-run win after posting 400/8 on the board, courtesy sizzling half-centuries from Ben Duckett, Joe Root, Harry Brook and Jacob Bethell. In response to England's mammoth score, the West Indies were bowled out for 162, with Saqib Mahmood and Jamie Overton grabbing three wickets apiece. The second ODI between the two sides commences today . News West Indies The West Indies have been fined for maintaining a slow over-rate during the first ODI against England , held on Thursday, May 29, in Edgbaston, Birmingham. Match Referee Jeff Crowe of the Emirates ICC Elite Panel imposed a five per cent fine on each player’s match fee, after Shai Hope’s team was found to be one over short of the required target at the end of the innings, once time allowances were taken into consideration. The penalty is in line with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel , which pertains to minimum over-rate offences. As per ICC regulations, players are fined five per cent of their match fee for each over their side fails to bowl within the allotted time. View this post on Instagram A post shared by ICC (@icc) West Indies captain Shai Hope accepted the sanction to the offence, with a formal hearing not deemed necessary. The charge was levelled by on-field umpires Kumar Dharmasena and Martin Saggers, along with third umpire Adrian Holdstock and fourth umpire Graham Lloyd. England registered a massive 238-run win after posting 400/8 on the board, courtesy sizzling half-centuries from Ben Duckett, Joe Root, Harry Brook and Jacob Bethell. In response to England's mammoth score, the West Indies were bowled out for 162, with Saqib Mahmood and Jamie Overton grabbing three wickets apiece. The second ODI between the two sides commences today . News West Indies News West Indies fined for slow over-rate in first England ODI News Webster seeks dream pairing in World Test Championship Final News West Indies fined for slow over-rate in first England ODI ICC World Test Championship Final, 2025 Proteas face Zimbabwe before World Test Championship Final"
  },
  {
    "title": "#mockdrill",
    "initial_info_desc": "Weekly Twitter trend in india: #mockdrill. Listed on June 2025.",
    "source_name": "Twitter (via www.twitter-trending.com)",
    "content_type": "Social Trend",
    "geo_region": "in",
    "meta_data": {
      "rank": 7,
      "tweet_volume_display": "N/A",
      "collected_at": "2025-06-01 11:14:27 UTC",
      "scraper_list_date": "June 2025",
      "period": "Weekly",
      "url": "https://www.twitter-trending.com/redirect?s=%2523mockdrill",
      "platform": "Twitter",
      "link_to_trend_list": "https://www.twitter-trending.com/india/en",
      "hashtags": [
        "#mockdrill"
      ]
    },
    "full_text_content_for_llm": "Trending topic on Twitter in in: '#mockdrill'. Listed on June 2025 for the Weekly period. Tweet volume: N/A."
  },
  {
    "title": "england lions",
    "initial_info_desc": "Google Trend: 'england lions'. Related: LIONS vs IND-A Cricket Scorecard, 1st unofficial Test at Canterbury, May 30 - June 02, 2025",
    "source_name": "Google Trends (trendspy)",
    "content_type": "Search Trend",
    "geo_region": "IN",
    "meta_data": {
      "rank": 8,
      "query": "england lions",
      "collected_at": "2025-06-01 11:14:20 UTC",
      "related_news": [
        {
          "title": "LIONS vs IND-A Cricket Scorecard, 1st unofficial Test at Canterbury, May 30 - June 02, 2025",
          "source": "ESPNcricinfo",
          "url": "https://www.espncricinfo.com/series/india-a-in-england-2025-1486324/england-lions-vs-india-a-1st-unofficial-test-1486333/full-scorecard"
        },
        {
          "title": "Kevin Pietersen&apos;s Big &quot;Two Gems&quot; Verdict On Karun Nair, KL Rahul. Gives Reason",
          "source": "NDTV Sports",
          "url": "https://sports.ndtv.com/england-vs-india-2025/kevin-pietersens-big-two-gems-verdict-on-karun-nair-kl-rahul-gives-reason-8553985"
        },
        {
          "title": "Haines hundred fuels Lions response after Karun Nair&apos;s 204",
          "source": "Cricbuzz.com",
          "url": "https://www.cricbuzz.com/cricket-news/134505/haines-hundred-fuels-lions-response-after-karun-nairs-204-cricbuzzcom"
        }
      ],
      "url": "https://www.espncricinfo.com/series/india-a-in-england-2025-1486324/england-lions-vs-india-a-1st-unofficial-test-1486333/full-scorecard"
    },
    "full_text_content_for_llm": "Google Trend: 'england lions'. Related: LIONS vs IND-A Cricket Scorecard, 1st unofficial Test at Canterbury, May 30 - June 02, 2025"
  }
]